Revit 2025 API
ExporterIFC.RemoveBuildingStorey Method
 Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void RemoveBuildingStorey(
	ElementId id
)
Public Sub RemoveBuildingStorey (
	id As ElementId
)
public:
void RemoveBuildingStorey(
	ElementId^ id
)
member RemoveBuildingStorey :
        id : ElementId -> unit
Parameters
id ElementId
 The level id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace